Revit 2027 API
ReinforcementSettings.GetRebarRoundingManager Method
 Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarRoundingManager GetRebarRoundingManager()
Public Function GetRebarRoundingManager As RebarRoundingManager
public:
RebarRoundingManager^ GetRebarRoundingManager()
member GetRebarRoundingManager : unit -> RebarRoundingManager
Return Value
RebarRoundingManager
 The rounding manager.
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace